# 4. Представлен список чисел. Необходимо вывести те его элементы, значения которых больше предыдущего, например:
# src = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
# result = [12, 44, 4, 10, 78, 123]
# Подсказка: использовать возможности python, изученные на уроке.

src = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]

for i in range(1, len(src)):     # 1-ый вариант
    if src[i] > src[i - 1]:
        print(src[i])

num_list = [src[i] for i in range(1, len(src)) if src[i] > src[i - 1]]       # 2-ой вариант

print(num_list)
